app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]
---
  def create
    params.inspect
    @post = Post.new(title: params["title"], description: params["description"])
    if @post.save